Revit 2027 API
BuiltInFailures.ElectricalFailures.CannotAddMorePolesToCircuit Property
 Empty slots are unavailable to hold the number of poles you specified for this spare. \nTo add more poles to this spare, you must free up slots by moving the circuits below the spare.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotAddMorePolesToCircuit { get; }
Public Shared ReadOnly Property CannotAddMorePolesToCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotAddMorePolesToCircuit {
	FailureDefinitionId^ get ();
}
static member CannotAddMorePolesToCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace